s1="万过薪月,员序程马黑来,nohtyP学"
s2=s1[::-1]
print(f"倒序为：{s2}")
s3=s2.split(',')
print(f"分割后为{s3}")
print(f"提取得：{s3[1].strip('来')}")
#2
my_list =["黑马程序员","传智播客","黑马程序员","传智播客","itheima","itcast","itheima","itcast","best"]
print(f"列表为：{my_list}")
t1=set()
for e in my_list:
    t1.add(e)

print(f"去重后的集合为：{t1}")
#3
c={"王力鸿":{"部门":"科技部",
             "工资":3000,
             "级别":1},
"周杰轮":{"部门":"市场部",
          "工资":5000,
          "级别":2},
"张学油":{"部门":"科技部",
          "工资":4000,
          "级别":1},
"林俊节":{"部门":"市场部",
         "工资":6000,
         "级别":3},
"刘德滑":{"部门":"市场部",
          "工资":6000,
          "级别":2}}
print(f"全体员工当前信息:\n{c}")
for key in c:
    if c[key]["级别"]==1:
        c[key]["工资"]+=1000
        c[key]["级别"]+=1

print(f"全体员工级别为1的员工完成升值加薪操作，操作后:\n{c}")